export const bilibiliAnalyticalTypeHints = {
    "1": `一次最多 10 个视频，不同链接间换行。少量多次稳定快速。

举个🌰,导出这二位的音频: 👇👇👇

【Earthy X6】-哔哩哔哩】 https://b23.tv/IOfEqZw 
【《香蜜沉沉烬如霜》片尾曲-哔哩哔哩】 https://b23.tv/W3i97LU`,
    "2": `使用该模式，可以将一个投稿的所有分 P 导出。

一次只支持一个投稿视频。
`,
    "3": `up主模式限时测试，能获取up主投稿的视频音频。

将个人主页的分享链接粘贴到这里即可，一次只支持一个up主的视频。

不会导出up所有视频或音频，实际数量由视频时长决定，如有更多数量需求请联系群主`,
    "4": `合集模式限时测试，解析一个合集下的所有视频。
    
这里填写 合集链接 或 合集包含的视频链接 都可以。

一次只支持一个合集。`
}

export const douyinAnalyticalTypeHints = {
    "1": `直接粘贴分享内容，自动解析抖音视频。一次最多 10 个视频，不同视频间换行。少量多次稳定快速。`,
    "3": `将作者的抖音主页链接（或分享口令）粘贴到此，会自动解析其视频，实际数量由视频时长决定，最多200个`,
}

export const shareTypeHints = {
    "1": "比较稳定，下载速度慢",
    "2": "下载快，敏感词较多，偶尔分享失败，不是很稳定",
    "3": "无需手动保存分享，最稳定，最省事",
}